#include <iostream>
#include <Windows.h>
#include "Deck.hpp"
#include "Card.hpp"
#include "Game.hpp"
//Поектирование прог в стиле ООП\
Игра 21:\
    карты(номиналы, масти)\
    колода(выбор)\
    игроки(имя, деньги, рука)\
    правила(какой колодой играют, сколько игроков, начало игры, условия победы, правила ходов)\
    стол(места игроков, ставка, колода, сброс, слоты для карт)\
    рука(набор карт игрока)\
    ведущий(это сама программа)\
    
    




int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    Game start;
    return 0;
}

